{"pageProps":{"post":{"attributes":{},"html":"<p>DOM stands for Document Object Model. It&#39;s a concept used in web development that represents the structure and content of a webpage in a way that programming languages can understand and manipulate.</p>\n<p>Here&#39;s a breakdown for someone new to programming:</p>\n<ol>\n<li><p><strong>Document:</strong> In the context of the web, a document refers to a webpage. It includes all the text, images, videos, links, and other elements that make up a webpage.</p>\n</li>\n<li><p><strong>Object:</strong> In programming, an object is a data structure that can contain both data (attributes or properties) and functions (methods) that can act upon that data.</p>\n</li>\n<li><p><strong>Model:</strong> A model is a representation or abstraction of something. In this case, the Document Object Model is a representation of the webpage&#39;s structure and content.</p>\n</li>\n</ol>\n<p>So, the DOM is essentially a way to represent a webpage (document) as a structured set of objects, which can be accessed and manipulated using programming languages like JavaScript. Each HTML element (like headings, paragraphs, images, etc.) on a webpage is represented as an object in the DOM. This allows programmers to interact with and modify the content and behavior of a webpage dynamically.</p>\n<p>For example, if you want to change the text of a paragraph on a webpage using JavaScript, you would use the DOM to locate that paragraph object and then update its content. Similarly, you can add new elements, remove existing ones, change styles, respond to user interactions, and more, all by manipulating the DOM.</p>\n<p>In essence, the DOM acts as an interface between web content and programming languages, enabling developers to create interactive and dynamic web experiences.</p>\n","markdown":"DOM stands for Document Object Model. It's a concept used in web development that represents the structure and content of a webpage in a way that programming languages can understand and manipulate.\n\nHere's a breakdown for someone new to programming:\n\n1. **Document:** In the context of the web, a document refers to a webpage. It includes all the text, images, videos, links, and other elements that make up a webpage.\n\n2. **Object:** In programming, an object is a data structure that can contain both data (attributes or properties) and functions (methods) that can act upon that data.\n\n3. **Model:** A model is a representation or abstraction of something. In this case, the Document Object Model is a representation of the webpage's structure and content.\n\nSo, the DOM is essentially a way to represent a webpage (document) as a structured set of objects, which can be accessed and manipulated using programming languages like JavaScript. Each HTML element (like headings, paragraphs, images, etc.) on a webpage is represented as an object in the DOM. This allows programmers to interact with and modify the content and behavior of a webpage dynamically.\n\nFor example, if you want to change the text of a paragraph on a webpage using JavaScript, you would use the DOM to locate that paragraph object and then update its content. Similarly, you can add new elements, remove existing ones, change styles, respond to user interactions, and more, all by manipulating the DOM.\n\nIn essence, the DOM acts as an interface between web content and programming languages, enabling developers to create interactive and dynamic web experiences.","slug":"document-object-model","title":"Document Object Model","section":"DOM","icon":"dumpster-fire","filePath":"/home/runner/work/pjsofts.github.io/pjsofts.github.io/lessons/02-DOM/A-document-object-model.md","nextSlug":"/lessons/DOM/DOM-exercises","prevSlug":"/lessons/Introduction-and-basics/intro"}},"__N_SSG":true}